meshing/blockMesh_mesh/transient_solution/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	inlet
	{
		type				fixedValue;
		value				(1 0 0);
	}

	outlet
	{
		type				fixedValue;
		value				(0 0 0);
	}

	ellipse
	{
		type				fixedValue;
		value				(0 0 0);
	}

	topAndBottom
	{
		type				fixedValue;
		value				$internalField;
	}

	frontAndBack
	{
		type            empty;
	}

	defaultFaces
	{
		type            empty;
	}
}

// ************************************************************************* //
